app/Validations/UserRules.php

SELECT *
FROM `users`
WHERE `email` = 'miguel@gmail.com'
 LIMIT 1
---
    public function validateUser( string $str, string $fields, array $data)
    {
        $userModel  =   new UserModel();
        $user       =   $userModel->where( 'email', $data[ 'emailFrm' ] )
                                  ->first();