app/Controllers/DashboardController.php

    public function index()
    {
        $userModel  =  new UserModel();
        $users      =   $userModel->asObject()->findAll();
---
SELECT *
FROM `users`