app/Controllers/UserController.php

                    'password'      =>  $this->request->getVar( 'pwdFrm' ),
                ];

                $userModel->save( $newData );
---
INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`) VALUES ('Miguel', 'Santisteban', 'miguel@gmail.com', '1234')