app/Controllers/UserController.php

                $data[ 'validation' ]   =   $this->validator;
            }else{
                $userModel  =   new UserModel();
                $user       =   $userModel->where( 'email', $this->request->getVar( 'emailFrm' ) )
                                          ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'miguel@gmail.com'
 LIMIT 1

                    'password'      =>  $this->request->getVar( 'pwdFrm' ),
                ];

                $userModel->save( $newData );
---
INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`, `created_at`) VALUES ('Miguel', 'Santisteban', 'miguel@gmail.com', '$2y$10$i2Fk8teTwm2r/74SAZuldufrEhykJfr3RDYE81PAahQdV3WLGZ2cO', '2023-12-25 01:44:51')